/******************************************************************************
 * @file    SMS_service.h
 * @author  zhouzhenyang
 * @date    2025-10-20
 ******************************************************************************
 * Description:
 *   学生信息管理服务模块的头文件，提供学生信息的增删改查服务接口声明
 *
 * Contains:
 *   - 服务函数声明
 ******************************************************************************
 * @version 1.0
 ******************************************************************************/

#ifndef SMS_SERVICE_H
#define SMS_SERVICE_H

/*=============================================================================
 *                           头文件包含区
 *===========================================================================*/

#include "SMS_data.h"

/*=============================================================================
 *                        函数声明区
 *===========================================================================*/

void sms_service_add_student(void);
void sms_service_display_all_students(void);
void sms_service_search_student(void);
void sms_service_delete_student(void);

#endif // SMS_SERVICE_H